[
  {
    "title": "Barbarians at the Gate (1989)",
    "slug": "barbarians-at-the-gate",
    "author": "Bryan Burrough & John Heylar",
    "date_posted": "10/16/25",
    "cover": "barbarians_at_the_gate.JPG",
    "summary": "This book tells the story of the leveraged buyout (LBO) of RJ Reynolds Nabisco, detailing the greed and excess of corporate America in the 1980s.",
    "thoughts": [
    "RJ Reynolds was a large family tobacco business that merged with Nabisco Brands in 1985.",
    "This story doesn't focus on one character but rather bounces between perspectives of the main players in the LBO.",
    "Some of the LBO talk was pretty complicated but essentially, an LBO involved borrowing lots of money to buy a company.",
    "Ross Johnson was the CEO of RJR Nabisco during the buyout talks and formed a management team to buy the company for themselves.",
    "They weren't expecting anyone to be able to match their huge bid which is when this story gets interesting."
    ],
    "map": "cigarette_map.png",
    "map_notes": [
      "While reading I got to wondering about the cigarette industry of the 1980s and who exactly was doing the most smoking.",
      "RJR's corporate headquarters were in North Carolina, as well as most of their manufacturing.",
      "So it's no surprise that (based on the map) they were getting high on their own supply.",
      "Seems like no coincidence that New Hampshire is shaped like a chimney",
      "And it looks like 80s Vegas was pulling its weight.",
      "One other standout is Utah...not too surprising considering the Mormon population. It appears they aren't big smokers."
    ],
    "code_snippet": [
      "def load_books():",
      "    with open('data/books.json') as f:",
      "        return json.load(f)"
    ],
    "code_notes": [
      "Data used in the map come from a public .csv file. 'The Tax Burden on Tobacco, 1970-2019 - Data.CDC.gov.'",
      "In the first section I create a new .csv file by filtering out the unnecessary columns.",
      "I really just need cigarette pack sales per capita and state abbreviations.",
      "You can see the filtered dataset printed below the first cell.",
      "After this I need to relate this dataset to the spatial state boundary (shapefile, .shp) dataset, which I got from somewhere else online.",
      "The key function is the states_gdf.merge function, which matches the state abbreviations from both datasets and combines them into one dataset. ",
      "After this I create the PyGMT figure.",
      "PyGMT is a Python implementation of the popular Generic Mapping Tools, a set of software tools written in C/C++ and mostly used by earth scientists.",
      "The best part is it's open source."
    ],
    "notebook": "cigarettes.html"
  },
  {
    "title": "The Boom (2014)",
    "slug": "the-boom",
    "author": "Russell Gold",
    "date_posted": "10/23/25",
    "cover": "the_boom.jpg",
    "summary": "A history of the practice of 'fracking' in the United States.",
    "thoughts": [
    "Fracking involves applying hydraulic pressure to shale rock in order to liberate more oil/gas from the rock.",
    "It's considered an 'unconventional' method of extracting oil/gas - conventional methods are less complicated (i.e., drill a hole and allow the oil/gas to come out through natural pressure.)",
    "I read this a long time ago so I don't remember many details about the companies and characters involved, I just thought it'd be easy to make a map related to it.",
    "I recall the story is mostly told though the eyes of former Chesapeake Energy CEO Aubrey McClendon and highlights his rise to fame."
    ],
    "map": "frac_map.jpg",
    "map_notes": [
      "I recently moved to New York (Buffalo), a state where fracking is banned completely due to environmental concerns.",
      "It has been linked to increased earthquake activity in several other regions where it is performed.",
      "I thought it might be interesting to see a comparison to a neighboring state where fracking is legal.",
      "Pennsylvania has massive hydrocarbon reserves in the Marcellus Shale geological formation which is present across much of the state (west of the Appalachian range).",
      "The map on the left shows a point at each fracked well. I'd take this with a grain of salt as I just plotted coorinates from a public 'Unconventional Well' dataset for Pennsylvania. ",
      "I suppose there may be other unconventional methods of extraction that aren't fracking.",
      "That's ok ... I just wanted to get some data on the page and look at it.",
      "It's a similar story for the NY State dataset.",
      "I filtered that dataset for 'Horizontal' wells, and while horizontal drilling often indicates fracking I suppose there are times when that isn't the case.",
      "Since there are many overlapping points on the first map I thought it would be useful to show a density grid for the points to better capture the data.",
      "For each 'cell' or 'pixel' in the area the number of points in that cell are summed.",
      "There are probably more interesting things I could do with these huge datasets but for now this is what you get."
    ],
    "code_snippet": [
      "def load_books():",
      "    with open('data/books.json') as f:",
      "        return json.load(f)"
    ],
    "code_notes": [
      "Data used in the maps come from public .csv files (links shown at the end of the code).",
      "This was my first time using the xyz2grd function in pygmt.",
      "This function can perform operations on x,y,z data - in my case I'm actually only using x and y data (coordinates), so z is given a dummy value (all 1s).",
      "The 'duplicate' parameter is set to 'n', which counts the number of points in cells of a size specified by the user (in this case, 0.1 arc degrees)."
    ],
    "notebook": "frac.html"
  },
  {
    "title": "A Fall of Moondust (1981)",
    "slug": "a-fall-of-moondust",
    "author": "Arthur Clarke",
    "date_posted": "10/27/25",
    "cover": "a_fall_of_moondust.jpg",
    "summary": "A group of moon tourists find themselves in a race against time after a freak accident during a voyage.",
    "thoughts": [
    "I went on an Arthur Clarke binge in 2024 after reading Rendezvous with Rama in 2023.",
    "This one wasn't my favorite of his but it's solid.",
    "It takes place on the moon where the main plot involves a group of space tourists and two subplots center around people involved with a rescue team.",
    "I felt that one of the subplots weakened the story a bit and wish he'd spent more time focused on the trapped tourists and fleshed out their characters a bit more.",
    "There was also a romantic subplot that felt a bit tacked on, which I've noticed in some of his other novels."
    ],
    "map": "a_fall_of_moondust.jpg",
    "map_notes": [
      "The tourists in the story start in a place called Port Roris and travel across what Clarke describes as a remarkably flat expanse of almost liquid-like dust.",
      "PyGMT actually has a built in function for downloading topographic Moon data (pygmt.datasets.load_moon_relief).",
      "The map on the left shows a simple shaded elevation map of the area of the moon that this book is allegedly based on (Sinus Roris), a large basaltic plain on the Moon's Northern Hemisphere.",
      "I also added a proposed location of the 'star port' in the book, Port Roris.",
      "The book doesn't specify exactly where it is but I put it on a solid rocky peninsula with good access to the flat dusty expanse.",
      "Youll notice that most of the elevation values on the Moon's surface are 'negative'.",
      "This is all relative to the datum used - on Earth the datum is based on sea level but since there's no water on the Moon they must use some other metric.",
      "The map on the right shows the 'flatness' of the same region, using a standard deviation function that inspects the elevation values of the surrounding pixels for each pixel.",
      "The lower the value, the 'flatter' the area.",
      "There's probably some other cool moon maps to make so I might have to read more moon books."
    ],
    "code_snippet": [
      "def load_books():",
      "    with open('data/books.json') as f:",
      "        return json.load(f)"
    ],
    "code_notes": [
      "Data used in the maps come from the moon relief database mentioned above.",
      "This was my first time using the 'grdgradient' function which gives elevation data a nice shaded look.",
      "To perform calculations on the elevation grid I had to convert it to a NumPy array 'moon_grid_array = moon_grid.values' and then back to an Xarray DataArray 'std_da = xr.DataArray'",
      "I'm not actually sure if it had to be converted to a NumPy array, there might be a way to do the standard deviation calcuations on the Xarray."
    ],
    "notebook": "a_fall_of_moondust.html"
  },
  {
    "title": "Dune (1965)",
    "slug": "dune",
    "author": "Frank Herbert",
    "date_posted": "10/29/25",
    "cover": "dune.jpg",
    "summary": "Several factions jostle for control of the planet Arrakis and its prized resource, 'spice'.",
    "thoughts": [
    "I read this before it was cool to read it.",
    "Just kidding, like everyone else I read it after they announced it would be made into a film with Timothee Chalamet.",
    "Dune has a strong first and second act with top-tier worldbuilding.",
    "For me it fell flat in the last quarter or so of the book, enough so that I wasn't that interested in reading the rest of the series.",
    "Endings are tough to write."
    ],
    "map": "dune.jpg",
    "map_notes": [
      "What else to make a map of than dunes.",
      "Luckily we have some pretty good ones right here on Earth.",
      "There's also no public dataset for the planet Arrakis so I didn't have much of a choice (maybe Mars has dunes?)",
      "The dunes in this map come from coastal Namibia which has some of the tallest dunes in the world.",
      "I wanted to get practice with a couple new PyGMT functions so I decided to make an elevation profile across a series of dunes."
    ],
    "code_snippet": [
      "def load_books():",
      "    with open('data/books.json') as f:",
      "        return json.load(f)"
    ],
    "code_notes": [
      "Data used in the maps come from PyGMT's built in earth relief dataset.",
      "This was a pure PyGMT script, no other libraries were used.",
      "This was my first time using the 'project' and 'grdtrack' functions.",
      "The 'project' function takes in coordinates and an interval.",
      "Then it returns a pandas DataFrame containing the two coordinates as the first and last values in the DataFrame, and interpolates points between them at the interval you set.",
      "The 'grdtrack' function takes in the elevation grid and the points generated from 'project', and appends an 'elevation' column to the DataFrame generated by 'project'.",
      "This gives you enough data to plot a smooth elevation profile between your two coordinates."
    ],
    "notebook": "dune.html"
  },
  {
    "title": "The Fountains of Paradise (1979)",
    "slug": "fountains-of-paradise",
    "author": "Arthur Clarke",
    "date_posted": "10/31/25",
    "cover": "fountains_of_paradise.jpg",
    "summary": "Earth takes on the task of building a space elevator to transport people and supplies into space without using rockets.",
    "thoughts": [
    "This book was, to some extent, a love letter to the country of Sri Lanka where Arthur Clarke lived most of his life, partially to puruse a scuba diving hobby.",
    "I can't remember the exact reason, but in the story Sri Lanka has some geographic anomaly that makes it the best location to build the elevator, and they decide to build it on top of a sacred mountain.",
    "A fair amount of the story deals with tensions between the governments and the native monks who live on the mountain.",
    "There are also several flashbacks to more ancient times between warring Sri Lankan tribes.",
    "Like other Clarke books this one has a lot of technical descriptions, especially regarding the engineering of the elevator.",
    "The finale is suspenseful, similar to A Fall of Moondust.",
    "Overall I think it fell a little flat and probably sits in the lower tier of Clarke books I've read so far.",
    "The story is heavily plot-driven and there aren't any particularly well fleshed-out characters."
    ],
    "map": "fountains_of_paradise.jpg",
    "map_notes": [
      "For this map I wanted to practice using the 3-D perspective abilities of PyGMT, which enables quite visually pleasing maps.",
      "Since the story is centered in Sri Lanka I decided to use the island as the focus.",
      "I also wanted to try overlaying an image onto a map and thought putting the Sri Lankan flag on the island would look neat."
    ],
    "code_snippet": [
      "def load_books():",
      "    with open('data/books.json') as f:",
      "        return json.load(f)"
    ],
    "code_notes": [
      "Data used in the maps come from PyGMT's built in earth relief dataset, and a .png image of the Sri Lankan flag I downloaded legally.",
      "The 3-D perspective is created using the .grdview method of the Figure class.",
      "Unique to this method are the 'perspective' and 'surftype' parameters which dictate the angle you view the figure from and the way the surface is mapped.",
      "I used rasterio to convert the .png image of the flag into an Xarray DataArray so it is usable by PyGMT.",
      "The second figure actually plots a surface twice: first the flag, then an elevation grid on top of it that omits the elevation values above zero so that the flag peeks through the hole.",
      "I wonder if there was a better way to do this.",
      "Ideally the flag would be smaller and more 'fitted' to the country area (the flag is actually much larger) but that would involve somehow centering the image only on the island area and not the entire map."
    ],
    "notebook": "fountains_of_paradise.html"
  },
  {
    "title": "The City and the Stars (1956)",
    "slug": "city-and-the-stars",
    "author": "Arthur Clarke",
    "date_posted": "11/4/25",
    "cover": "city_and_the_stars.jpg",
    "summary": "A young man escapes his futuristic utopian city to seek the truth about what happened to Earth.",
    "thoughts": [
    "Clarke does a great job of building the lore around the city of Diaspar and describing how the inhabitants are created and interact.",
    "I tend to to prefer more character-driven stories like this one (which follows Alvin, a native of Diaspar who has certain special qualities).",
    "Alvin has questions about the origin of the city, its people, and what lies outside the impenetrable, sprawling desert that surrounds it.",
    "There's a great sense of mystery and discovery the reader gets to experience with Alvin.",
    "I think Clarke's creative side shone in this one.",
    "The latter part of the book is in sharp contrast to the 'realistic' (or at least loosely 'science-plausible') first act.",
    "Maybe a bit too fantastical for me.",
    "Still, this is probably a top 3 Clarke novel."
    ],
    "map": "city_and_the_stars.jpg",
    "map_notes": [
      "The story describes Diaspar as a great city in a vast expanse of desert on a dead Earth.",
      "[Spoilers ahead] By the end of the book Alvin is able to harness the power of a superintelligent being and has plans to revitalize the planet back to its former glory.",
      "I imagine water would be one of the first things Alvin would attempt to import.",
      "This map shows what the Earth might look like after an initial very very large shipment of comets was brought to Earth and melted into a new ocean.",
      "I chose -4000 m depth since it created some interesting-looking new continents.",
      "Most of the new land area occurs at the mid-ocean ridges and the new continents are fairly flat and boring.",
      "On this new Earth Madagascar is now a part of mainland Africa and the Northern hemisphere is now basically a megacontinent."
    ],
    "code_snippet": [
      "def load_books():",
      "    with open('data/books.json') as f:",
      "        return json.load(f)"
    ],
    "code_notes": [
      "Data used in the maps come from PyGMT's built in earth relief dataset.",
      "This was my first time creating a custom colormap (solid tan for values above -4500 m and a blue gradient for values below).",
      "PyGMT can read these colormap ('.cpt') files which contain information about the colors to be used when displaying data.",
      "This script writes .cpt files to the folder where the script is and then reads from those .cpt files.",
      "Colormaps I've used in previous maps have all been built-in colormaps (of which there are many).",
      "Most map projections preserve one aspect of the real world (distances, areas, angles) to make them practically useful.",
      "This map uses the Robinson projection which actually doesn't preserve any particular aspect but was created to look aesthetically pleasing."
    ],
    "notebook": "city_and_the_stars.html"
  },
  {
    "title": "The Walmart Effect (2006)",
    "slug": "walmart-effect",
    "author": "Charles Fishman",
    "date_posted": "11/11/25",
    "cover": "walmart_effect.jpg",
    "summary": "The history of Walmart and its economic impact.",
    "thoughts": [
    "I think most people generally have a negative impression of Walmart.",
    "'Predatory wages, lower-class shoppers, small-business killer, dystopian megacorp.'",
    "I admit this was my impression of the store as well, especially after working there one summer during college.",
    "This book doesn't necessarily pick a side but I think it opened my eyes to some of the benefits Walmart provides, namely",
    " lower-priced goods so people can afford other things and jobs for areas that may not have many employment opportunities.",
    "The book also describes Walmart as a tightly-run ship that minimizes corporate waste (a far cry from the RJR Nabisco story).",
    "Overall the book challenges the reader to weigh their desire for cheaper goods with the hidden costs they bring."
    ],
    "map": "walmart_effect.jpg",
    "map_notes": [
      "How many Walmarts are there?",
      "The dataset I found it a bit dated (2018), but contained 4654 stores (which includes Alaska, Hawaii, and Puerto Rico which aren't in the map).",
      "I wondered what place in the lower 48 states is the furthest from a Walmart.",
      "There appears to be some sort of gridding artifact happening in the northern Montana area.",
      "I'm not sure it's legitimate.",
      "I think the orange-colored area in Nevada is likely the the furthest from any Walmart.",
      "I also asked ChatGPT what it would say the most remote places are in the contiguous USA, and it gave me the 5 locations marked with orange stars on the map.",
      "I can understand all but the Florida one.",
      "No idea what it was thinking there."
    ],
    "code_snippet": [
      "def load_books():",
      "    with open('data/books.json') as f:",
      "        return json.load(f)"
    ],
    "code_notes": [
      "Walmart store data used in the map comes from a wesbite called Kaggle.",
      "This one was definitely a challenge and involved quite a bit of pre-processing.",
      "Creating a custom grid from scratch involved a lot of NumPy functions I hadn't used before (meshgrid, ravel, etc).",
      "The nearest-neighbor query (cKDTree) from scipy.spatial was really cool and I'll probably use it more in the future.",
      "This was my first time creating a mask with a shapefile which is also extremely useful when you want to ignore certain regions (in this case, everything outside the contiguous US)."
    ],
    "notebook": "walmart_effect.html"
  }
]
