[
  {
    "title": "Barbarians at the Gate (1989)",
    "slug": "barbarians-at-the-gate",
    "author": "Bryan Burrough & John Heylar",
    "date_posted": "10/16/25",
    "cover": "barbarians_at_the_gate.JPG",
    "summary": "This book tells the story of the leveraged buyout (LBO) of RJ Reynolds Nabisco, detailing the greed and excess of corporate America in the 1980s.",
    "thoughts": [
    "RJ Reynolds was a large family tobacco business that merged with Nabisco Brands in 1985.",
    "This story doesn't focus on one character but rather bounces between perspectives of the main players in the LBO.",
    "Some of the LBO talk was pretty complicated but essentially, an LBO involved borrowing lots of money to buy a company.",
    "Ross Johnson was the CEO of RJR Nabisco during the buyout talks and formed a management team to buy the company for themselves.",
    "They weren't expecting anyone to be able to match their huge bid which is when this story gets interesting."
    ],
    "map": "cigarette_map.png",
    "map_notes": [
      "While reading I got to wondering about the cigarette industry of the 1980s and who exactly was doing the most smoking.",
      "RJR's corporate headquarters were in North Carolina, as well as most of their manufacturing.",
      "So it's no surprise that (based on the map) they were getting high on their own supply.",
      "Seems like no coincidence that New Hampshire is shaped like a chimney",
      "And it looks like 80s Vegas was pulling its weight.",
      "One other standout is Utah...not too surprising considering the Mormon population. It appears they aren't big smokers."
    ],
    "code_snippet": [
      "def load_books():",
      "    with open('data/books.json') as f:",
      "        return json.load(f)"
    ],
    "code_notes": [
      "Data used in the map come from a public .csv file. 'The Tax Burden on Tobacco, 1970-2019 - Data.CDC.gov.'",
      "In the first section I create a new .csv file by filtering out the unnecessary columns.",
      "I really just need cigarette pack sales per capita and state abbreviations.",
      "You can see the filtered dataset printed below the first cell.",
      "After this I need to relate this dataset to the spatial state boundary (shapefile, .shp) dataset, which I got from somewhere else online.",
      "The key function is the states_gdf.merge function, which matches the state abbreviations from both datasets and combines them into one dataset. ",
      "After this I create the PyGMT figure.",
      "PyGMT is a Python wrapper for the popular Generic Mapping Tools, a set of software tools written in C/C++ and used by earth scientists mostly.",
      "The best part is it's open source."
    ],
    "notebook": "cigarettes.html"
  },
  {
    "title": "The Boom (2014)",
    "slug": "the-boom",
    "author": "Russell Gold",
    "date_posted": "10/23/25",
    "cover": "the_boom.jpg",
    "summary": "A history of the practice of 'fracking' in the United States.",
    "thoughts": [
    "Fracking involves applying hydraulic pressure to shale rock in order to liberate more oil/gas from the rock.",
    "It's considered an 'unconventional' method of extracting oil/gas - conventional methods are less complicated (i.e., drill a hole and allow the oil/gas to come out through natural pressure.)",
    "I read this a long time ago so I don't remember many details about the companies and characters involved, I just thought it'd be easy to make a map related to it.",
    "I recall the story is mostly told though the eyes of former Chesapeake Energy CEO Aubrey McClendon and highlights his rise to fame."
    ],
    "map": "frac_map.jpg",
    "map_notes": [
      "I recently moved to New York (Buffalo), a state where fracking is banned completely due to environmental concerns.",
      "It has been linked to increased earthquake activity in several other regions where it is performed.",
      "I thought it might be interesting to see a comparison to a neighboring state where fracking is legal.",
      "Pennsylvania has massive hydrocarbon reserves in the Marcellus Shale geological formation which is present across much of the state (west of the Appalachian range).",
      "The map on the left shows a point at each fracked well. I'd take this with a grain of salt as I just plotted coorinates from a public 'Unconventional Well' dataset for Pennsylvania. ",
      "I suppose there may be other unconventional methods of extraction that aren't fracking.",
      "That's ok ... I just wanted to get some data on the page and look at it.",
      "It's a similar story for the NY State dataset.",
      "I filtered that dataset for 'Horizontal' wells, and while horizontal drilling often indicates fracking I suppose there are times when that isn't the case.",
      "Since there are many overlapping points on the first map I thought it would be useful to show a density grid for the points to better capture the data.",
      "For each 'cell' or 'pixel' in the area the number of points in that cell are summed.",
      "There are probably more interesting things I could do with these huge datasets but for now this is what you get."
    ],
    "code_snippet": [
      "def load_books():",
      "    with open('data/books.json') as f:",
      "        return json.load(f)"
    ],
    "code_notes": [
      "Data used in the maps come from public .csv files (links shown at the end of the code).",
      "This was my first time using the xyz2grd function in pygmt.",
      "This function can perform operations on x,y,z data - in my case I'm actually only using x and y data (coordinates), so z is given a dummy value (all 1s).",
      "The 'duplicate' parameter is set to 'n', which counts the number of points in cells of a size specified by the user (in this case, 0.1 arc degrees)."
    ],
    "notebook": "frac.html"
  },
  {
    "title": "A fall of Moondust (1981)",
    "slug": "a-fall-of-moondust",
    "author": "Arthur Clarke",
    "date_posted": "10/23/25",
    "cover": "a_fall_of_moondust.jpg",
    "summary": "A group of moon tourists find themselves in a race against time after a freak accident during a voyage.",
    "thoughts": [
    "I went on an Arthur Clarke binge in 2024 after reading Rendezvous with Rama in 2023.",
    "This one wasn't my favorite of his but it's solid.",
    "It takes place on the moon where the main plot involves a group of space tourists and two subplots center around people involved with a resuce team.",
    "I felt that one of the subplots weakened the story a bit and wish he'd spent more time focused on the trapped tourists and fleshed out their characters a bit more.",
    "There was also a romantic subplot that felt a bit tacked on, which I've noticed in some of his other novels."
    ],
    "map": "a_fall_of_moondust.jpg",
    "map_notes": [
      "The tourists in the story start in a place called Port Roris and travel across what Clarke describes as a remarkably flat expanse of almost liquid-like dust.",
      "PyGMT actually has a built in function for downloading topographic Moon data (pygmt.datasets.load_moon_relief).",
      "The map on the left shows a siple shaded elevation map of the area of the moon that this book is allegedly based on (Sinus Roris), a large basaltic plain on the Moon's Northern Hemisphere.",
      "I also added a proposed location of the 'star port' in the book, Port Roris.",
      "The book doesn't specify exactly where it is but I put it on a solid rocky peninsula with good access to the flat dusty expanse.",
      "Youll notice that most of the elevation values on the Moon's surface are 'negative'.",
      "This is all relative to the datum used - on Earth the datum is based on sea level but since there's no water on the Moon they must use some other metric.",
      "The map on the right shows the 'flatness' of the same region, using a standard deviation function that inspects the elevation values of the surrounding pixels for each pixel.",
      "The lower the value, the 'flatter' the area.",
      "There's probably some other cool moon maps to make so I might have to read more moon books."
    ],
    "code_snippet": [
      "def load_books():",
      "    with open('data/books.json') as f:",
      "        return json.load(f)"
    ],
    "code_notes": [
      "Data used in the maps come from the moon relief database mentioned above.",
      "This was my first time using the 'grdgradient' function which gives elevation data a nice shaded look.",
      "To perform calculations on the elevation grid I had to convert it to a NumPy array 'moon_grid_array = moon_grid.values' and then back to an Xarray DataArray 'std_da = xr.DataArray'",
      "I'm not actually sure if it had to be converted to a NumPy array, there might be a way to do the standard deviation calcuations on the Xarray."
    ],
    "notebook": "a_fall_of_moondust.html"
  }
]
